<template>
  <div>
    <music-player :sets="sets" :autoplay="autoplay"></music-player>
    <!-- <audio autoplay="true" loop="true" src="http://music.163.com/song/media/outer/url?id=300136.mp3"></audio> -->
  </div>
</template>

<script>
  import Vue from 'vue'
  import MusicPlayer from '../components/music_player'
  // import Resource from '../lib/resource'

  export default {
    components: {
      "music-player": MusicPlayer,
    },
    data() {
      return {
        // resource: {
        //   service: 'nature',
        //   resource: 'rhythm.rhythm_sets',
        //   data: {},
        // }
        sets: [{
          songs: [{
            index: 0,
            avatar: "http://p1.music.126.net/yp8qCRkDQj2NzQ68hzhEJA==/19145795974603349.jpg",
            lyric: "[00:00.000] 作曲 : ANU↵[00:01.000] 作词 : ANU↵[00:03.93]音乐制作人：旦旦↵[00:11.820]ཚིག ཨ་ནུ་རིང་ལུགས།↵[00:12.590]དབྱངས ཨ་ནུ་རིང་ལུགས།↵[00:16.500]གཞས་པ ཨ་ནུ་རིང་ལུགས།↵[00:21.460]འཕུར↵[00:22.700]འཕུར་འདོད་དུས།↵[00:25.900]འཕུར↵[00:27.690]ལས་དབང་གི་གོ་ཆ་ནས་གྲོལ་ཏེ།↵[00:31.110]རང་དབང་གི་རིང་ལུགས་ལ་དགའ་ན།↵[00:34.710]ད་ནས་འཕུར་ཡ་་་་་↵[00:36.990]ད་ནས་འཕུར་ཡ་་་་་↵[00:39.980]འཕུར↵[00:42.730]རང་གི་རྣམ་ཤེས་ངོ་མ་དེ་འཚོལ་བསམ་ན་འཕུར།↵[00:47.300]རང་གི་ཆེས་ཐོག་མའི་རྨི་ལམ་དེ་འཚོལ་བསམ་ན་འཕུར།↵[00:51.660]འཕུར་་་་↵[00:54.080]འཕུར་་ཡ་་་་་་་↵[00:56.530]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[01:01.230]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[01:05.910]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[01:10.560]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[01:15.280]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[01:20.000]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[01:22.750]དེ་ནས་རང་དབང་གི་གཤོག་པ་དེ་བརྐྱངས་ནས།↵[01:25.030]དེ་ནས་ངོ་མཚར་གྱི་རྨི་ལམ་དེ་ཁྱེར་ནས།↵[01:27.210]འཁོར་བའི་རྒྱ་མཚོ་ནས་བརྒལ་ཏེ་བདེ་སྐྱིད་ཀྱི་ཞིང་ཁམས་ལ་འཕུར།↵[01:32.000]དེ་ནས་ཆེས་ཐོག་མའི་རྣམ་ཤེས་དེ་འཚོལ་ལ་འཕུར།↵[01:37.360]འཕུར་ར།↵[02:00.080]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[02:05.210]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[02:09.820] མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[02:12.490]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[02:18.000] འཕུར↵[02:18.850]འཕུར་འདོད་དུས།↵[02:21.960]འཕུར↵[02:23.770]ཆོ་མེད་པའི་འཚོ་བ་ནས་ཐར་ཏེ།↵[02:27.330]ཚེ་སྲོག་གི་ངོ་མཚར་ལ་དད་ན།↵[02:30.770]ད་ནས་འཕུར་ཡ་་་་་↵[02:33.250]ད་ནས་འཕུར་ཡ་་་་་↵[02:36.030]འཕུར↵[02:38.620]རང་གི་ཆེས་མཛེས་པའི་འཛུམ་མདངས་དེ་འཚོལ་བསམ་ན་འཕུར།↵[02:43.390]རང་གི་ཆེས་རང་ཉིད་ངོ་མ་དེ་འཚོལ་བསམ་ན་འཕུར།↵[02:47.940]འཕུར་་་་↵[02:50.410]འཕུར་ཡ་་་་་་་↵[02:52.560]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[02:57.210]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[03:01.920]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[03:06.660]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[03:11.360]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[03:16.090]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[03:18.740]ལས་དབང་གི་གོ་ཆ་ནས་གྲོལ་ཏེ།↵[03:21.090]རང་དབང་གི་རིང་ལུགས་ལ་དགའ་ན་འཕུར་ར།↵[03:24.610]རང་གི་རྣམ་ཤེས་ངོ་མ་དེ་འཚོལ་བསམ་ན།↵[03:27.120]རང་གི་ཆེས་ཐོག་མའི་རྨི་ལམ་དེ་འཚོལ་བསམ་ན།↵[03:29.290]ཆོ་མེད་པའི་འཚོ་བ་ནས་ཐར་ཏེ་ཚེ་སྲོག་གི་ངོ་མཚར་ལ་དད་ན་འཕུར་ར།↵[03:35.140]རང་གི་ཆེས་མཛེས་པའི་འཛུམ་མདངས་དེ་འཚོལ་བསམ་ན།↵[03:38.400]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[03:47.750]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[03:52.540]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[03:57.160]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[04:01.870]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[04:06.610]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵[04:11.330]མ་འཕུར་ན་མི་ཚེ་ཚར་རྒྱུ་རེད།↵[04:15.970]མ་འཕུར་ན་རེ་བ་བརླག་རྒྱུ་རེད།↵",
            name: "FLY-飞",
            playedCount: 0,
            singer: "ANU",
            translatedLyric: "[by:Gurmey]↵[00:11.820]↵[00:12.590]↵[00:16.500]↵[00:21.460]飞↵[00:22.700]当你想展翅翱翔之时↵[00:25.900]飞↵[00:27.690]突破命运的束缚↵[00:31.110]若想自由飞翔↵[00:34.710]从此刻飞翔↵[00:36.990]从此刻飞翔↵[00:39.980]飞↵[00:42.730]如果想追寻自己内心深处的灵魂↵[00:47.300]如果想追寻自己最初的梦想↵[00:51.660]飞↵[00:54.080]飞吧↵[00:56.530]若不飞翔，生命将会流逝↵[01:01.230]若不飞翔，梦想将会破灭↵[01:05.910]若不飞翔，生命将会流逝↵[01:10.560]若不飞翔，梦想将会破灭↵[01:15.280]若不飞翔，生命将会流逝↵[01:20.000]若不飞翔，梦想将会破灭↵[01:22.750]展开自由的翅膀↵[01:25.030]带着神奇的梦想↵[01:27.210]穿过轮回飞往幸福之地↵[01:32.000]追寻内心深处的灵魂↵[01:37.360]飞吧↵[02:00.080]若不飞翔，梦想将会破灭↵[02:05.210]若不飞翔，生命将会流逝↵[02:09.820]若不飞翔，梦想将会破灭↵[02:12.490]若不飞翔，生命将会流逝↵[02:18.000]飞↵[02:18.850]当你想展翅翱翔之时↵[02:21.960]飞↵[02:23.770]解脱枯燥乏味的生活↵[02:27.330]若想获得生命的灿烂↵[02:30.770]从此刻飞翔↵[02:33.250]从此刻飞翔↵[02:36.030]飞↵[02:38.620]如果想追寻自己最美的微笑↵[02:43.390]如果想追寻最真实的自己↵[02:47.940]飞↵[02:50.410]飞吧↵[02:52.560]若不飞翔，生命将会流逝↵[02:57.210]若不飞翔，梦想将会破灭↵[03:01.920]若不飞翔，生命将会流逝↵[03:06.660]若不飞翔，梦想将会破灭↵[03:11.360]若不飞翔，生命将会流逝↵[03:16.090]若不飞翔，梦想将会破灭↵[03:18.740]突破命运的束缚↵[03:21.090]若想自由飞翔↵[03:24.610]如果想追寻自己内心深处的灵魂↵[03:27.120]如果想追寻自己最初的梦想↵[03:29.290]解脱乏味的生活获得生命的灿烂↵[03:35.140]追寻自己最美的微笑↵[03:38.400]若不飞翔，生命将会流逝↵[03:47.750]若不飞翔，梦想将会破灭↵[03:52.540]若不飞翔，生命将会流逝↵[03:57.160]若不飞翔，梦想将会破灭↵[04:01.870]若不飞翔，生命将会流逝↵[04:06.610]若不飞翔，梦想将会破灭↵[04:11.330]若不飞翔，生命将会流逝↵[04:15.970]若不飞翔，梦想将会破灭",
            src: "http://music.163.com/song/media/outer/url?id=479422828.mp3",
          }],
        }],
        autoplay: true,
      }
    },
    methods: {
    },
    mounted () {
    },
  }

</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style>
  h1 {
    color: #42b983;
  }

  .logo {
    width: 100px;
    height: 100px;
  }
</style>
